<?php
$lang['ftp_no_connection'] = 'Байланыш ID табылган жок. Файл операцияларын аткаруудан мурун туташканыңызды текшериңиз.';
$lang['ftp_unable_to_connect'] = 'Белгиленген хост атын колдонуп FTP сервериңизге туташуу мүмкүн эмес.';
$lang['ftp_unable_to_login'] = 'FTP сервериңизге кире албай жатат. Колдонуучу атыңызды жана паролуңузду текшериңиз.';
$lang['ftp_unable_to_mkdir'] = 'Сиз көрсөткөн каталог түзүлбөй койду.';
$lang['ftp_unable_to_changedir'] = 'Каталогдорду өзгөртүү мүмкүн эмес.';
$lang['ftp_unable_to_chmod'] = 'Файл уруксаттарын коюу мүмкүн эмес. Сураныч, файл жолуңузду текшериңиз.';
$lang['ftp_unable_to_upload'] = 'Көрсөтүлгөн файл жүктөлгөн жок. Сураныч, файлыңызды текшериңиз.';
$lang['ftp_unable_to_download'] = 'Көрсөтүлгөн файл жүктөлгөн жок. Сураныч, файл жолуңузду текшериңиз.';
$lang['ftp_no_source_file'] = 'Булак файл табылган жок. Сураныч, файл жолуңузду текшериңиз.';
$lang['ftp_unable_to_rename'] = 'Файлдын атын өзгөртүү мүмкүн эмес.';
$lang['ftp_unable_to_delete'] = 'Файл жок кылынбай калды.';
$lang['ftp_unable_to_move'] = 'Файл жылдырылган жок. Максаттуу папка бар экенин текшериңиз.';



/* End of file ftp_lang.php */
/* Location: ./application/language/russian/ftp_lang.php */
