<?php
$lang['imglib_source_image_required'] = 'Сүрөт жөндөөлөрүнүн түпкөлүгүн көрсөтүңүз керек.';
$lang['imglib_gd_required'] = 'Бул функция GD сүрөт китепканасын талап кылат.';
$lang['imglib_gd_required_for_props'] = 'Сүрөттүн касиеттерин аныктоо үчүн сервериңиздеги GD сүрөт китепканасын колдоого алышы керек.';
$lang['imglib_unsupported_imagecreate'] = 'Сервериңиз бул сүрөт түрүн иштетүү үчүн талап кылган GD функциясын колдобойт.';
$lang['imglib_gif_not_supported'] = 'GIF сүрөттөрү көбүнчө лицензиялык чектөөлөрдөн уланат. Анын ордуна JPG же PNG сүрөттөрүн колдонушуңуз керек болот.';
$lang['imglib_jpg_not_supported'] = 'JPG сүрөттөрү колдоого алынбайт.';
$lang['imglib_png_not_supported'] = 'PNG сүрөттөрү колдоого алынбайт.';
$lang['imglib_jpg_or_png_required'] = 'Сүрөттөрүңүздүн өлчөмүн өзгөртүү үчүн тек JPEG же PNG сүрөт түрлөрү менен иштейт.';
$lang['imglib_copy_error'] = 'Файлды көчүрүүдө ката кетти. Сураныч, файл каталогуңуздун жазылышы мүмкүн экенин текшериңиз.';
$lang['imglib_rotate_unsupported'] = 'Сүрөттү айландыруу сервериңиз тарабынан колдоого алынбайт.';
$lang['imglib_libpath_invalid'] = 'Сүрөт китепканасынын жолу туура эмес. Сураныч, сүрөт жөндөөлөрүнөн туура жолду көрсөтүңүз.';
$lang['imglib_image_process_failed'] = 'Сүрөт иштетилбей калды. Сервериңиздеги тандалган протокол менен сүрөттөр китепканасынын жолун туура эмесдигин текшериңиз.';
$lang['imglib_rotation_angle_required'] = 'Сүрөттү айландыруу үчүн айлануу бурчу талап кылынат.';
$lang['imglib_invalid_path'] = 'Сүрөттүн жолу туура эмес.';
$lang['imglib_invalid_image'] = 'Берилген сүрөт жараксыз.';
$lang['imglib_copy_failed'] = 'Сүрөттү көчүрүү процедурасы иштеп кетти. Сураныч, файл каталогуңуздун жазылышы мүмкүн экенин текшериңиз.';
$lang['imglib_missing_font'] = 'Колдонуучуга шрифт табылган жок.';
$lang['imglib_save_failed'] = 'Сүрөт сакталган жок. Сүрөт жана файл каталогу жазылышы мүмкүн экенин текшериңиз.';


/* End of file imglib_lang.php */
/* Location: ./application/language/russian/imglib_lang.php */
